uhnp/src/Documents/УстановкаНациональногоРежима/УстановкаНациональногоРежима.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаНациональногоРежима</name>
  <registerRecords>InformationRegister.ПараметрыПреференцийОКПД2</registerRecords>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приказ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыПреференцийОКПД2</name>
    <attributes>
      <name>ОКПД2</name>
      <type>
        <types>CatalogRef.КлассификаторОКПД2</types>
      </type>
    </attributes>
    <attributes>
      <name>НациональныйРежимЗакупок</name>
      <type>
        <types>EnumRef.НациональныйРежимЗакупок</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ПараметрыПреференцийОКПД2/ПараметрыПреференцийОКПД2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыПреференцийОКПД2</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапретОграничение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НациональныйРежимЗакупок</name>
    <type>
      <types>EnumRef.НациональныйРежимЗакупок</types>
    </type>
  </resources>
  <dimensions>
    <name>ОКПД2</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/НациональныйРежимЗакупок/НациональныйРежимЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НациональныйРежимЗакупок</name>
  <enumValues>
    <name>НеИспользовать</name>
  </enumValues>
  <enumValues>
    <name>Преференции</name>
  </enumValues>
  <enumValues>
    <name>Ограничение</name>
  </enumValues>
  <enumValues>
    <name>Запрет</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/УстановкаНациональногоРежима/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Для Каждого СтрокаПараметров Из Объект.ПараметрыПреференцийОКПД2 Цикл   
		Если СтрокаПараметров.НациональныйРежимЗакупок = Перечисления.НациональныйРежимЗакупок.Преференции И
			СтрокаПараметров.Значение = 0 Тогда                                               
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Для ОКПД %1 не указано значение преференции'"), СтрокаПараметров.ОКПД2),,,
													"Объект.ПараметрыПреференцийОКПД2["+СтрЗаменить(СтрокаПараметров.ПолучитьИдентификатор(), Символы.НПП, "")+"].Значение", 
													Отказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы   

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьНациональныйРежим(Команда) 
	ОткрытьФорму("Документ.УстановкаНациональногоРежима.Форма.ФормаВыбораНациональногоРежима",,ЭтотОбъект,,,,Новый ОписаниеОповещения("УстановитьНациональныйРежимЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Перем ВыборкаДетальныеЗаписи, Запрос, НоваяСтрока, РезультатЗапроса;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторОКПД2.Ссылка КАК ОКПД2,
	|	ПараметрыПреференцийОКПД2СрезПоследних.Значение КАК Значение,
	|	ЕСТЬNULL(ПараметрыПреференцийОКПД2СрезПоследних.НациональныйРежимЗакупок, ЗНАЧЕНИЕ(Перечисление.НациональныйРежимЗакупок.НеИспользовать)) КАК НациональныйРежимЗакупок
	|ИЗ
	|	Справочник.КлассификаторОКПД2 КАК КлассификаторОКПД2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыПреференцийОКПД2.СрезПоследних КАК ПараметрыПреференцийОКПД2СрезПоследних
	|		ПО (ПараметрыПреференцийОКПД2СрезПоследних.ОКПД2 = КлассификаторОКПД2.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОКПД2";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	Объект.ПараметрыПреференцийОКПД2.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		НоваяСтрока = Объект.ПараметрыПреференцийОКПД2.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьНациональныйРежимНаСервере(Знач ВыделенныеСтроки, Значение)
	Для Каждого ОКПД2Ид Из ВыделенныеСтроки Цикл      
		СтрокаТаблицы = Объект.ПараметрыПреференцийОКПД2.НайтиПоИдентификатору(ОКПД2Ид);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Значение, "НациональныйРежимЗакупок"); 
		СтрокаТаблицы.Значение = Значение.Преференции;
	КонецЦикла;
	
КонецПроцедуры
	
&НаКлиенте
Процедура УстановитьНациональныйРежимЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		УстановитьНациональныйРежимНаСервере(Элементы.ПараметрыПреференцийОКПД2.ВыделенныеСтроки, Результат);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
